Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 于向阳瞳孔微缩，戏剧性的倒退了几步，不可置信的看她。
en_us: Yu Xiangyang's pupils constricted a little and he took a few steps back dramatically, looking at her in disbelief.

source: 于向阳知道自己的下场。
en_us: Yu Xiangyang knew the outcome that he would face.

source: 于向阳突然有些惊慌，感觉有什么东西脱离了自己的掌控......
en_us: Yu Xiangyang suddenly panicked and felt like he had lost control of something...

source: 于向阳背脊一阵发凉。
en_us: Yu Xiangyang felt a cold chill down his spine.

source: 于向阳觉得自己多看一眼都觉得恶心。
en_us: Yu Xiangyang would feel disgusted just by looking at her.

source: 于向阳长得有些清瘦，五官柔和，气质高冷，给人一种眼前一亮，如沐春风的感觉。
en_us: Yu Xiangyang was rather slender and his features were soft. He had an aloof aura and he would never fail to make the eyes of others glisten.

source: 于向阳闻言，脸色黑了黑。
en_us: Yu Xiangyang's face turned sullen after he heard her words.

source: 于是她笑了笑说：“阿漓说的也是，是阿姨这边大意了，等会儿再去给你找几个会做的营养师过来，保准不会让你失望。”
en_us: Hence, she smiled and said, "Li, you're right. I was too careless. I'll look for a better nutritionist later. I promise you won't be disappointed."

source: 于是疑惑的回头看他，也不说话。
en_us: Hence, she turned around to look at him in bewilderment without saying anything.

source: 于此同时，一条【热！枫神竟在帝都大学门口包场请神秘女子吃饭！】的话题瞬间霸占了所有社交软件。
en_us: At the same time, a topic titled "Hot! Ye Feng has invited a mysterious woman to lunch at a restaurant by the entrance of the university that he had booked!", appeared on all social media platforms.

source: 人一走，徐夫人便恢复了以往的笑，招呼着叶漓家几兄妹：“走吧，都进去坐，凤年和他爷爷都等你们许久了。”
en_us: As soon as they left, Mrs. Xu put on her usual smile and entertained Ye Li and her brothers. "Let's go, come in and have a seat. Fengnian and his grandfather have been waiting for you guys for a long time."

source: 人不在，事情自然也很快被大家忘在了脑后。
en_us: Since she was not around, everyone soon forgot about the matter.

source: 人家帝都首富的存在，确实是瞧不起他那点钱。
en_us: Ye Li's family was the wealthiest family in the capital and indeed, his money did not appeal to her at all.

source: 人家都不愿意跟她在一起，她竟然还备注这么亲昵，真有那么喜欢那个人吗？
en_us: 'He doesn't even want to be with her but she's addressing him with such an affectionate term. Does she really like him that much?'

source: 人群中仿佛被人抛入了一颗炸弹，瞬间了炸了锅。
en_us: It was as if a bomb had been thrown into the crowd and it exploded immediately.

source: 什么丑八怪，什么土肥圆。
en_us: He felt that she was ugly, tacky and chubby, only because she didn't reveal her pretty face.

source: 什么情况，他怎么也在这里，还在徐家的私人餐桌上？
en_us: 'What's going on? Why is here too at the Xu Family's private dining table?'

source: 什么情况？
en_us: 'What's the matter?'

source: 什么时候被人这般说过。
en_us: Since when had she ever been criticized like this?

source: 今儿个下楼，叶眉母女都没在。
en_us: She headed downstairs to see that Ye Mei and her mother were both not around.

source: 今儿个她还要去参加徐家的聚会，这女人就出现了，叶漓不禁联想起了上辈子发生的事情。
en_us: Today, she had to attend the Xu Family's social gathering and yet, Ye Mei appeared. Ye Li couldn't help but think about the event that occurred in her previous life.

source: 今儿个妹妹在学校出事的事情，他们都知道了，这会儿一忙完就赶紧回来。
en_us: They had all heard about what happened to their younger sister in school today and rushed home immediately after they were done with work.

source: 今儿个的叶漓心情特别好，虽然逃了一天课，但是她今天的课程并不多，也不在意。
en_us: Ye Li was in a particularly good mood today. Although she had skipped an entire day of classes, she did not have many classes for the day so she did not mind it at all.

source: 今儿个糖棍都被她咬扁了，才熬到下课。
en_us: She managed to hang on until the end of class after finishing the entire lollipop.

source: 今夜，对某些人来说，是不眠之夜。
en_us: It was a sleepless night for her.

source: 今天她没穿校服，穿着一条米黄色的碎花连衣裙。
en_us: She was not wearing the school uniform today. Instead, she was wearing a yellow floral dress.

source: 从小就没有母亲的她缺少母爱，是秦柔给了她这些，所以对她十分听话孝顺。
en_us: Ever since she was a child, she lacked maternal love. Qin Rou was the one who showed her maternal love. Hence, she was very obedient and filial towards Qin Rou.

source: 从来没想到，她竟然会有着这样一层身份。
en_us: He did not expect her to have that identity.

source: 从没注意过这个男人的声音这么好听。
en_us: She had never paid attention to how pleasant his voice was.

source: 他一向不喜欢针对女人，更别说那两个只是二十来岁的大学生。
en_us: He had never liked going against women, not to mention, college students who were only in their early twenties.

source: 他一惊，一个不可思议的想法突然就涌上了心头。
en_us: Greatly taken aback, an incredulous idea suddenly popped up in his mind.

source: 他不爱学习，成绩也不好，但是因为这张脸，与叶漓的情况大庭相反。
en_us: He hated studying and had poor grades too but he was well-liked by the other students because of his good looks, unlike Ye Li.

source: 他不能怕，不能在这些天之骄子面前低头。
en_us: 'I can't be afraid, I can't bow down in front of these privileged people who are favored by heaven.'

source: 他了解你吗？
en_us: 'Does he understand you?'

source: 他了解我就好了。
en_us: 'It's enough that he understands me.'

source: 他们一走，寂静的会客厅就仿佛被人抛下一颗炸弹，砰地炸成了锅。
en_us: As soon as they left, a commotion broke out in the quiet guest hall, as if a bomb had exploded.

source: 他们以为隐藏妹妹的身份，能让她安安心心的上完这个大学，不会因为身份而受到各种居心不良的人骚扰，可谁想，这样的举动却险些毁了他们的宝贝！
en_us: They thought that Ye Li would be able to complete her college education in peace by keeping her identity a secret to prevent others from harassing her. To their surprise, that almost ruined their precious baby!

source: 他们同意徐家的婚事，一是因为两家关系好，那边的人都很宠爱阿漓，这样她嫁过去也不会受委屈。
en_us: The agreed to let Ye Li marry into the Xu Family, partly because the two families were on good terms with each other and the people of the Xu Family doted on Ye Li. Hence, she would not suffer any mistreatment after marrying Xu Fengnian.

source: 他们女神礼服没得到不说，还被ys拉黑，被逼道歉，简直太惨了。
en_us: Not only did their goddess, Ye Mei, not get to buy the dress, she even got blacklisted by YS Fashion and was forced to make a public apology. How devastating.

source: 他们手持一张红色请帖，说说笑笑的排着队进入这座豪华的庄园。
en_us: They were each holding a red-colored invitation card and were lining up to enter the luxurious manor while chatting merrily with each other.

source: 他们文艺系男生并不多，大多都是女孩子，而且这个年纪的女孩子都十分会控制身材，班上清一色的骨感美女。
en_us: There were very few boys in the Faculty of Arts and most of the students were girls who at this age, paid a lot of attention to keeping themselves in shape. All the girls in class were thin beauties.

source: 他们明显就是这一类人。
en_us: They clearly belonged to that type.

source: 他们疼爱的妹妹，自己从来不忍心说上一句狠话的宝贝疙瘩，竟然被外面的人这般欺辱！
en_us: Their beloved younger sister, whom they had never had the heart to be harsh towards, actually got bullied and horrendously insulted by outsiders!

source: 他们的导购还表示，当时看到已经提醒。
en_us: Their sales assistant stated that she had already reminded Ye Mei not to do it at that time.

source: 他们看见了什么，他们看见了什么。
en_us: They saw something.

source: 他们胆子是大，但是也只是敢私下闹闹，哪里敢闹到警察局，到时候不仅是学校的人，就连家里的人都会被惊动！
en_us: Although they were bold, they only dared to confront others and stir trouble in private. They wouldn't dare to blow things up and go to the police station at all. If that were to happen, not only would the people in school be alerted, even her family members would be informed!

source: 他们记得没错的话，家里和小妹同一个学校的就只有叶眉了吧。
en_us: If they remembered correctly, Ye Mei was the only one in the family who went to the same school as their younger sister.

source: 他们谁也别想打徐凤年的主意。
en_us: No one should try to covet what Xu Fengnian had.

source: 他们这些大家族的一举一动都能引起整个城市的动荡，所以对于这些大事，一向都是十分的隐秘，只有自家的人和少许关系好的人才会知道。
en_us: They were powerful and influential families who could easily cause a stir in the entire city. Hence, they had always been secretive about such events. Only their own family members and a small, select group of people whom they were close to would find out.

source: 他们这里是禁止拍照的，刚刚这位小姐拍了，按规矩来说，这条裙子她是必须要带走的。
en_us: Photography was prohibited in the store and according to the rules, Ye Mei had to buy the gown because she had snapped a photo of it.

source: 他何时不许她叫了。
en_us: Since when had he ever forbade her from addressing him that way?

source: 他做出一副深情的态度。
en_us: He made himself seem like he was very devoted.

source: 他出现在徐家聚会上也不奇怪，毕竟如今两家联姻的事情已经传的沸沸扬扬，谁人不知。
en_us: It was not strange for him to appear at the gathering hosted by the Xu Family. After all, word about a marriage between the two families had already spread like wildfire. Everyone knew it.

source: 他叫徐晗，年龄二十，身高一米八五，身材很好，十分喜欢各种极限运动，家里十分有钱，随便一双球鞋都是七位数，因为一张篮球照在学校出名，成为了不少女孩倾慕暗恋的对象。
en_us: His name was Xu Han. He was 20 years old this year, and had a good figure, with a stature of 1.85 meters. He was particularly fond of all kinds of extreme sports, and coming from an extremely affluent family, every pair of shoes that belonged to him would easily cost seven figures. After he rose to fame because of a photo of him playing basketball, many girls in school adored him and developed crushes on him.

source: 他和叶枫玩在一起，一是因为他的身份崇高，二是流量庞大。
en_us: One reason he decided to be friends with Ye Feng was because of the latter's esteemed status and the other was because of his popularity and influence.

source: 他咳嗽了一声，也不是真看不懂这些女人的心思。
en_us: He coughed. It was not that he really didn't understand the intentions of women.

source: 他如今确实优秀，无论是在学校还是娱乐圈都混得不错。
en_us: He was indeed very outstanding now and was rahter popular in school and in the entertainment industry.

source: 他如何得罪得起。
en_us: How could he afford to provoke them?

source: 他娘的，刚还一副剑拔弩张的模样，这才几分钟呢，就一副相见恨晚，恨不得拜把子了。
en_us: 'Damn it, she was so haughty and arrogant just now but it's only been a few minutes and she's already regretting her actions.'

source: 他平时出去跟人家说话，十句话九句不忘夸赞自家妹妹，可妹妹非不愿意透露自己的身份，这可让叶枫没少憋屈，他是真恨不得全世界都知道自己有个宝贝妹妹。
en_us: Usually, he would praise Ye Li in front of others all the time but she was never willing to reveal her identity, which made Ye Feng feel a little dejected because he really wished that the world would know about the existence of his precious sister.

source: 他当时看着都觉得疼。
en_us: When he saw Meng Fei's palm, he felt that it looked really painful, what more the victim herself

source: 他微微惊讶，赶忙走过去，就见叶家小姐正坐在他们总裁怀里，两人不知道在说些什么，他们冷酷总裁的脸这会儿是要多温柔就有多温柔。
en_us: Slightly astonished, he hurriedly walked over, only to see that Ye Li was lying in his CEO's arms while talking to him about something. The look on his cool and aloof CEO's face was extremely gentle and tender.

source: 他心里一阵恼怒。
en_us: He was filled with exasperation.

source: 他心里更多的是担忧。
en_us: He was more worried about her than anything else.

source: 他怎么会在哪里？
en_us: 'What was he doing there?'

source: 他愣了一下，下意识扫向了她周围跟着的人。
en_us: Slightly stunned, he subconsciously looked at the people around her.

source: 他愣了一会，反应过来之后脸色更难看了。
en_us: After being dumbfounded for a while, he realized what was going on and his expression became even more awful.

source: 他成熟又完美，是年轻一代的佼佼者，可就是这样的男人，却是一个妹控！
en_us: He was mature and perfect, and a leader of the younger generation. However, a powerful man like him actually doted on his younger sister greatly!

source: 他收到妹妹发的消息，就直接从公司赶过来了，脸妆容都来不及卸，这会儿帅人一脸。
en_us: Once he received a message from Ye Li, he rushed over from the company immediately without even removing his makeup yet. He looked extremely handsome.

source: 他收回了目光，冷漠的点了点头。
en_us: He looked away and nodded indifferently.

source: 他整个人都震惊了。
en_us: He was astonished.

source: 他无奈的叹了口气，道：“阿漓，下来。”
en_us: He sighed helplessly and said, "Li, get down."

source: 他是她三哥哥叶枫的朋友，两人关系不错，都在娱乐圈混的风生水起，不同的是，于向阳的家室并不好，但是他却是学校为数不多知道叶漓身份的人之一。
en_us: He was a close friend of her third brother, Ye Feng, and had rose to fame in the entertainment industry with the latter. However, unlike Ye Feng, Yu Xiangyang did not come from a wealthy and powerful family. Yet, he was one of the few people in school who knew about Ye Li's true identity.

source: 他是怎么想也没想到，叶漓竟然是叶枫的妹妹。
en_us: He would have never expected Ye Li to be Ye Feng's younger sister.

source: 他是认识自家儿子的兄弟的，毕竟带回来好几次，自家宝贝女儿还对对方倾心，叶明就是不想注意都难。
en_us: He knew who his son's close friend was. After all, his son had invited the latter home several times before and his precious daughter adored him too. It was hard for Ye Ming not to notice him.

source: 他有些复杂的抿了抿唇，走了过去。
en_us: He pursed his lips in a complicated manner and walked over.

source: 他死死的盯着叶漓。
en_us: He stared at Ye Li.

source: 他气质慵懒，白色的衬衫有些凌乱，头发都是乱糟糟的，可偏偏这样的形象，非但没有给人一丝邋遢的感觉，竟然还莫名的帅气。
en_us: He looked rather sluggish and laid back, his white shirt a little messy, just like his hair. However, he did not look disheveled or sloppy at all. Instead, he seemed somewhat handsome.

source: 他疑惑的看向自家大哥，叶洛却摇了摇头。
en_us: He looked at Ye Luo in apprehension but the latter shook his head.

source: 他的胸口有些发烫。
en_us: His chest was burning.

source: 他眉眼一寒，顾不得身份快步靠近。
en_us: His eyes turned cold and he strode forwards quickly with no regards of his identity.

source: 他看了看屏幕中两人发出的聊天消息。
en_us: He looked at their text message conversation on the screen of his mobile phone.

source: 他眼神一紧，这才注意到叶漓今天的装扮。
en_us: He fixed his gaze and finally noticed Ye Li's appearance today.

source: 他脸色依旧冷淡。
en_us: His expression was still rather cold and indifferent.

source: 他说着轻轻的揉起来。
en_us: He then rubbed her head gently.

source: 他还以为是因为叶漓的关系，她才不敢开口，他因此对叶漓也十分的厌恶，可这会儿，却听到了这样的话。
en_us: He initially thought it was because of Ye Li that she did not dare to accept him. Hence, he was extremely disgusted with Ye Li and detested her greatly. Yet, he actually heard those words from Ye Meu.

source: 他还因此曾心疼过叶眉，为她打抱不平。
en_us: He had once even took pity on Ye Mei and stood up for her because of that.

source: 他还没说话，一旁的程艳就忍不住了：“让你退学是因为你名声败坏，风气不雅，影响我们学校的名誉，你以为仅仅是退学就完了吗？你还得赔偿孟非一百万的治疗费用和道歉！”
en_us: Before he even spoke, Cheng Yan, who was at the side, finally couldn't tolerate it anymore. "We want to expel you because you've got a terrible reputation and poor morals. You will affect the school's reputation too. Do you think expulsion is the only punishment you're going to face? You have to compensate Meng Fei with a million yuan for treatment, and apologize to her!"

source: 他还设置为置顶，但凡一进来的粉丝都能看到这条微博。
en_us: He even pinned that tweet so that all the fans who tapped on his account would be able to see it.

source: 他这个人最注重的就是名声。
en_us: He placed the most emphasis on his reputation.

source: 他这么一说，叶漓突然就想起来了。
en_us: After hearing his words, Ye Li suddenly remembered something.

source: 他进来的时候，正好遇到阴沉着脸出去的于向阳。
en_us: When he entered, he happen to run into Yu Xiangyang who was leaving with a sullen expression.

source: 以为自己真的拿她没办法吗？
en_us: 'Does she really think I can't do anything about her?'

source: 以前可以不在意。
en_us: He could ignore it in the past.

source: 以前她的性格冲动，叶眉越这么说 ，她就越是生气，越是要去帮她讨回公道。
en_us: In the past, she was impulsive and reckless. The more Ye Mei turned down her offer, the more she would want to do Ye Mei justice and stand up for her.

source: 以前的叶漓总是用一头浓密的头发遮住脸，给人的第一眼就不好看，也没有人多注意过她，就连拍的照片都只露出了个下巴，平时学校的人那么多，大家亲眼见过的也不多，不是很熟的人还真没有认出来。
en_us: In the past, Ye Li used to cover her face with her thick hair and at first glance, she looked rather unpleasant and no one paid much attention to her. Even in pictures, she would only reveal her chin. Many students in school had seen her in person before but only those who were close to her would be able to recognize her.

source: 以至于叶漓还没回应，官方这边直接@了她。
en_us: The official account of YS Fashion tagged Ye Mei before Ye Li even responded.

source: 以至于学习成绩一直都是在班级排名倒数，大家就以为她是学习很差的那一类人。
en_us: Besides, her academic results had always been at the bottom of the ranks in her class. Hence, everyone thought that she was a student with poor grades.

source: 以至于才发没多久，就已近好几百万的点赞和评论转发。
en_us: As a result, the tweet garnered millions of likes, replies, and retweets soon after he sent it.

source: 任是那个男人这会儿心里都不会好受。
en_us: No man would feel good about hearing those words.

source: 仿佛像是看一个陌生人。
en_us: She seemed to be a stranger.

source: 仿佛已经看到自己坐在他腿上的场面。
en_us: It was as if they had seen her sitting on his lap.

source: 众人上上下下的打量着叶漓，惊喜的发现这个女孩长相虽然圆润的紧，但是通身气质清冷高贵，那双微微向上挑的狐狸眼，给人一种又纯又欲的感觉。
en_us: Everyone sized Ye Li up from head to toe and they were surprised to find that although she was extremely plump, she had a sophisticated and noble aura, and her slightly upturned foxy eyes were innocent yet seductive.

source: 众人不禁有些怀疑起了事情的真相。
en_us: Everyone could not help but be a little suspicious of the truth of the matter.

source: 众人也是有些怪异的看向叶眉。
en_us: Everyone else looked at Ye Mei with bewildered expressions as well.

source: 众人厌恶的看向叶漓，仿佛她已经是十恶不赦的罪人一般。
en_us: Everyone looked at Ye Li in disgust, as if she had committed an unforgivable sin.

source: 众人呆了。
en_us: Everyone was shocked out of their wits.

source: 众人大脑嗡的一声，只觉得这是谁，要完了！
en_us: There was a sudden buzzing in everyone's heads and they thought, 'Who's this? Oh dear!'

source: 众人奇异的看着这一幕，仿佛见了鬼。
en_us: Everyone looked at this scene in bewilderment, as if they had seen a ghost.

source: 众人将锅甩到了叶眉身上。
en_us: Everyone put the blame on Ye Mei.

source: 众人小声的议论纷纷起来，刚刚还对叶漓改变的惊讶，逐渐变成了嫌恶。
en_us: The people around them began discussing one after another. The shock that they had from seeing the changes in Ye Li's expression, gradually turned into disgust.

source: 众人怜悯的目光落到了叶漓身上，
en_us: Everyone cast looks of sympathy at Ye Li.

source: 众人惊呼一声。
en_us: Everyone gasped in shock.

source: 众人惊愕不已。
en_us: The crowd was stunned.

source: 众人愣住了。
en_us: Everyone was stunned.

source: 众人暗暗吸气。
en_us: Everyone sighed secretly.

source: 众人疯了，粉丝们疯了！
en_us: The crowd and the fans broke into hysterics!

source: 众人的态度纷纷倒戈。
en_us: Everyone's attitudes immediately became reversed.

source: 众人的目光一下就落到了叶漓身上。
en_us: Everyone looked at Ye Li again.

source: 众人的目光一下落到了她的身上。
en_us: All eyes were immediately on her.

source: 众人看到叶漓被人挖出来的照片之后，纷纷开始吐槽了起来。
en_us: Everyone began criticizing Ye Li after photos of her younger self were exposed.

source: 众人看到叶漓被她这样对待，还不明白吗？
en_us: Everyone finally understood it all after seeing the way she treated Ye Li.

source: 众人看的心痒痒。
en_us: Everyone was attracted to her.

source: 众人看着这神一般的转折，呆愣到了极点。
en_us: Everyone was dumbfounded when they saw the sudden change.

source: 众人看见徐媛同叶眉打招呼，一副好似很熟悉的模样，都纷纷好奇她是什么人。
en_us: When they saw Xu Yuan talking to Ye Mei and seemed to be chummy with her, they began to wonder who Ye Mei was.

source: 众人眼神闪烁片刻，心里有了底。
en_us: Everyone's eyes glistened and they had an answer.

source: 众人说到这里，顿时义愤填膺的看向叶漓，那目光好似要吃人一般，“叶漓，看在你妹妹的份儿上，这事情我们就不找你麻烦了，但是你必须得站出来当面承认，你自杀的事情跟我们男神没有关系！不然我们一心向阳粉绝对不会放过你的！”有女生站了出来，威胁叶漓道。
en_us: At the mention of this, they immediately looked at Ye Li menacingly with righteous indignation, as if they wanted to eat her up. "Ye Li, for the sake of your sister, we won't hold you accountable for this matter. However, you must come forth and admit that your attempt at suicide has nothing to do with our idol! Otherwise, we, the fans of Xiangyang, will never let you off!" a girl threatened Ye Li.

source: 众人越说越是过分了起来。
en_us: Their remarks began to get overboard.

source: 众人这才恍然大悟。
en_us: Everyone had an epiphany.

source: 众人都不是傻子，稍稍仔细一想，就察觉到了这其中的怪异之处。
en_us: The people were no fools and after thinking about it carefully, they noticed the peculiarity of the matter.

source: 众人闻言纷纷应声。
en_us: Everyone expressed assent after hearing her words.

source: 众人面面相觑一眼。
en_us: Everyone looked at each other.

source: 众人面面相觑一眼，都从对方的眼中看到了深意。
en_us: Everyone looked at each other in puzzlement, and noticed the hidden meaning in each other's eyes.

source: 众粉丝顿时有种被人欺骗的感觉。
en_us: The fans immediately felt cheated.

source: 传出了这样的丑闻，爷爷怎么会同意叶漓嫁进来？
en_us: If there was such a scandal, how could her grandfather agree to let Ye Li marry Xu Fengnian?

source: 伸手拿过一旁桌上放着的礼盒。
en_us: She reached out to grab the gift box on the table at the side.

source: 伸手捏住了对方靠近的手臂，叶漓反手就给了对方一巴掌。
en_us: He reached out to pinch the arm that was closest to her and slapped them.

source: 似乎是注意到了她们的目光，徐媛看了过来，对上叶漓的双眼之后，笑容微顿，随后走了过来。
en_us: Seemingly having sensed their gazes, Xu Yuan looked over and made eye contact with that person. Her smile stiffened and she walked over.

source: 但其实她的上身十分的均匀。
en_us: However, her figure was actually very well proportioned.

source: 但凡早一点知道，叶漓背后是这样的身份，她们就是有十个胆子，也不敢上来招惹啊！
en_us: Had they known about Ye Li's identity, they would have never dared to provoke her!

source: 但她不想去别的大学。
en_us: However, she did not want to go to other colleges either

source: 但她性格好，人优秀，又是学霸，在学校女神排行榜排名前五，班级排名第一，出了名的清纯女神。
en_us: However, she had a brilliant personality and was a star student. Hence, she was ranked in the top five of the "College Goddess" rankings, and was first in her class. She was known for being a pure and innocent goddess-like girl.

source: 但是也有少许死活不改的粉丝：“是她自己不早说的，我们误会了也正常，凭什么要道歉？”
en_us: However, there were still a few fans who refused to admit to their mistakes. "She was the one who refused to clarify things earlier. It's only normal for us to get the wrong idea. Why must we apologize?"

source: 但是今天的聚会非同寻常。
en_us: However, the gathering today was extraordinary.

source: 但是今年，却是至关重要的一年。
en_us: However, this year was a crucial one.

source: 但是去医院的照片却不知道被谁拍到，发到了学校网上，自此之后，她又背上了一个整容之名。
en_us: However, someone happened to snap some photos of her going to the hospital and uploaded it to the campus website. Since then, she was labeled as the girl who wanted to go for plastic surgery.

source: 但是叶洛，但凡是商场上的人，无一不知他的大名。
en_us: However, Ye Luo was a famous businessman.

source: 但是叶漓却十分出名。
en_us: However, Ye Li was exceptionally famous because of Ye Li.

source: 但是叶眉依然恨。
en_us: However, Ye Mei was still filled with hatred and resentment.

source: 但是因为之前他们针对叶漓的事，所以几乎没有人敢上前主动搭话。
en_us: However, almost no one dared to take the initiative to talk to Ye Li because they had been attacking her previously, let alone ask her to help them get an autograph from Ye Feng.

source: 但是她毫不犹豫的拒绝了，丝毫不给那边的人面子，徐阿姨徐叔叔一直把她当亲女儿一样宠爱，她却丝毫不给面子，真是混账！
en_us: However, she turned them down without hesitation and did not show them any respect at all. Xu Fengnian's parents had always doted on her like she was their daughter and yet, she still treated them that way. She was such a jerk!

source: 但是如今却也没有上辈子那种憋屈的感觉了。
en_us: Unlike in her previous life, she did not feel aggrieved at all.

source: 但是如今有阿漓了，自然不能再装作没看见。
en_us: However, now that he had Ye Li, he naturally couldn't pretend not to notice.

source: 但是学校里面拥有百万粉丝的人太多了，甚至几百万的都有，特别是校花莉莉安，因为是个中俄混血，长得像是瓷娃娃，身材又十分性感，连续霸榜了两年校花之位。
en_us: However, there were many students in school who had over a million fans and there were even those who had millions of fans, especially the campus belle Lilian. Due to the fact that she was of mixed ethnicity, Chinese and Russian, she looked like a porcelain doll and also had a sensual figure. She was the campus belle for two consecutive years.

source: 但是家世确实很差。
en_us: However, his family background was poor.

source: 但是很快他们的梦就碎了。
en_us: However, soon, their dreams were shattered.

source: 但是既然阿漓说了，那必定就是这知事人中其中之一，而他们最熟悉的，无非就是叶眉，于向阳还有叶枫的那几个好兄弟。
en_us: However, since Ye Li had already said so, Ye Mei must be one of the people who knew about the matter. Besides, Ye Mei, Yu Xiangyang, and Ye Feng's close friends were the ones whom they were the most familiar with.

source: 但是眼前这一辆，却是全球只有两辆限量版豪车。
en_us: However, the one in front of them was one of the only two limited edition luxury cars in the world.

source: 但是程艳就不这么想了。
en_us: However, Cheng Yan thought otherwise.

source: 但是自己的成绩在国外也只算是中等，听徐媛这么一说，徐倩顿时有些拿不准主意。
en_us: However, Xu Qian's grades were mediocre and she immediately felt uncertain and indecisive after hearing Xu Yuan's words.

source: 但是要想要达到苗条，至少还要瘦上十斤才足够。
en_us: However, in order to become slim, she would have to lose at least five more kilograms.

source: 但是谁也不愿意夸自己讨厌的人漂亮。
en_us: However, no one would be willing to compliment the beauty of someone they hated.

source: 但是这个时候，她是真的不敢再作死了，哆哆嗦嗦的开口：“对不起叶漓，我知道错了，你放过我们吧。”
en_us: She said in a shaky voice, "Sorry, Ye Li, I know my mistake. Please spare us."

source: 但是这件事已经过了一个多小时，学校里的人几乎都知道了。
en_us: However, it had already been more than an hour since that matter passed and almost everyone in school knew about it.
